--------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/inventory/Downloads/sandra.log
  log type:  text
 opened on:   7 Nov 2017, 14:39:14

. *Safe drinking water
. prtesti 19 0.88 19 0.78

Two-sample test of proportions                     x: Number of obs =       19
                                                   y: Number of obs =       19
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |        .88   .0745513                      .7338822    1.026118
           y |        .78   .0950346                      .5937356    .9662644
-------------+----------------------------------------------------------------
        diff |         .1   .1207869                      -.136738     .336738
             |  under Ho:   .1218714     0.82   0.412
------------------------------------------------------------------------------
        diff = prop(x) - prop(y)                                  z =   0.8205
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7940         Pr(|Z| < |z|) = 0.4119          Pr(Z > z) = 0.2060

. 
. *Safe fecal disposal of feces
. prtesti 19 0.669 19 0.33

Two-sample test of proportions                     x: Number of obs =       19
                                                   y: Number of obs =       19
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |       .669   .1079569                      .4574084    .8805916
           y |        .33   .1078742                      .1185705    .5414295
-------------+----------------------------------------------------------------
        diff |       .339   .1526156                      .0398789    .6381211
             |  under Ho:   .1622213     2.09   0.037
------------------------------------------------------------------------------
        diff = prop(x) - prop(y)                                  z =   2.0897
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.9817         Pr(|Z| < |z|) = 0.0366          Pr(Z > z) = 0.0183

. 
. *Presence of handwashing facilities with cleaning agent
. prtesti 19 0.098 19 0.17

Two-sample test of proportions                     x: Number of obs =       19
                                                   y: Number of obs =       19
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |       .098   .0682087                     -.0356865    .2316865
           y |        .17   .0861761                       .001098     .338902
-------------+----------------------------------------------------------------
        diff |      -.072   .1099033                     -.2874065    .1434065
             |  under Ho:   .1105222    -0.65   0.515
------------------------------------------------------------------------------
        diff = prop(x) - prop(y)                                  z =  -0.6515
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.2574         Pr(|Z| < |z|) = 0.5148          Pr(Z > z) = 0.7426

. 
. *Safe water storage
. prtesti 19 0.594 19 0.42

Two-sample test of proportions                     x: Number of obs =       19
                                                   y: Number of obs =       19
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |       .594   .1126625                      .3731855    .8148145
           y |        .42   .1132301                      .1980731    .6419269
-------------+----------------------------------------------------------------
        diff |       .174   .1597307                     -.1390664    .4870664
             |  under Ho:   .1622055     1.07   0.283
------------------------------------------------------------------------------
        diff = prop(x) - prop(y)                                  z =   1.0727
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.8583         Pr(|Z| < |z|) = 0.2834          Pr(Z > z) = 0.1417

. 
. *Safe garbage disposal
. prtesti 19 0.256 19 0.32

Two-sample test of proportions                     x: Number of obs =       19
                                                   y: Number of obs =       19
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |       .256    .100122                      .0597644    .4522356
           y |        .32    .107017                      .1102506    .5297494
-------------+----------------------------------------------------------------
        diff |      -.064   .1465505                     -.3512337    .2232337
             |  under Ho:   .1469178    -0.44   0.663
------------------------------------------------------------------------------
        diff = prop(x) - prop(y)                                  z =  -0.4356
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.3316         Pr(|Z| < |z|) = 0.6631          Pr(Z > z) = 0.6684

. 
. *Handwashing at critical times
. prtesti 19 0.391 19 0.29

Two-sample test of proportions                     x: Number of obs =       19
                                                   y: Number of obs =       19
------------------------------------------------------------------------------
    Variable |       Mean   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |       .391    .111949                       .171584     .610416
           y |        .29   .1041002                      .0859674    .4940326
-------------+----------------------------------------------------------------
        diff |       .101   .1528706                     -.1986209    .4006209
             |  under Ho:   .1537461     0.66   0.511
------------------------------------------------------------------------------
        diff = prop(x) - prop(y)                                  z =   0.6569
    Ho: diff = 0

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(Z < z) = 0.7444         Pr(|Z| < |z|) = 0.5112          Pr(Z > z) = 0.2556

. 
. log close
      name:  <unnamed>
       log:  /Users/inventory/Downloads/sandra.log
  log type:  text
 closed on:   7 Nov 2017, 14:39:14
--------------------------------------------------------------------------------------------------------------------------------------
